Revit 2024 API
VertexPositionNormal Properties
The VertexPositionNormal type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Vertex.)
Normal
 The vertex's normal vector.
Position
 The vertex's position.
See Also
VertexPositionNormal Class
Autodesk.Revit.DB.DirectContext3D Namespace